# Pandas и работа с датасетами

In [35]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
pd.__version__

'2.0.1'

# Создание Series и DataFrame из списков и словарей

In [37]:
# Создание объекта Series
test_series = pd.Series([12,-4,7,9])
print(test_series)

0    12
1    -4
2     7
3     9
dtype: int64

In [38]:
type(test_series)

pandas.core.series.Series

In [39]:
# Также мы можем конвертировать объект NumPy в объект pandas.Series
test_series = pd.Series(np.array([1, 2, 3, 4, 5]))
test_series

0    1
1    2
2    3
3    4
4    5
dtype: int64

#### Как говорилось в презентации объект типа Series обладает индексом и массивом значений. Мы имеем доступ к нему и если необходимо увидеть оба массива, из которых состоит структура, можно вызвать два атрибута: index и values (array).

In [40]:
test_series.index

RangeIndex(start=0, stop=5, step=1)

In [41]:
test_series.array

<PandasArray>
[1, 2, 3, 4, 5]
Length: 5, dtype: int64

## Создание объекта DataFrame из словаря

In [42]:
dataList = [
    { 'date': '2023-06-01', 'value': 10 },
    { 'date': '2023-06-02', 'value': 200 },
    { 'date': '2023-06-03', 'value': 30 },
    { 'date': '2023-06-04', 'value': 400 },
    { 'date': '2023-06-05', 'value': 50 },
]

In [43]:
pd.DataFrame(dataList)

         date  value
0  2023-06-01     10
1  2023-06-02    200
2  2023-06-03     30
3  2023-06-04    400
4  2023-06-05     50

In [44]:
# то же самое, но в другом виде где мы задаем столбцы в формате словаря
# {key1 : [values1], ..., keyN: [valuesN]}
dataDict = {
    'date': [ '2022-06-01', '2022-06-02', '2022-06-03', '2022-06-04', '2022-06-05' ],
    'value': [ 10, 200, 30, 400, 50 ]
}

pd.DataFrame.from_dict( dataDict )

         date  value
0  2022-06-01     10
1  2022-06-02    200
2  2022-06-03     30
3  2022-06-04    400
4  2022-06-05     50

In [45]:
# В случае если нам необходимо сохранить порядок следования элементов мы можем использовать лист вместо словаря
# [(columnName, [values]),..., (columnNameN, [valuesN])]
dataDict = [
    ( 'date', ['2022-06-01', '2022-06-02', '2022-06-03', '2022-06-04', '2022-06-05' ] ),
    ( 'value',  [ 10, 200, 30, 400, 50 ])
]

pd.DataFrame.from_dict(dict(dataDict))

         date  value
0  2022-06-01     10
1  2022-06-02    200
2  2022-06-03     30
3  2022-06-04    400
4  2022-06-05     50

In [46]:
# Создания датафрейма из списка кортежей с указанием заголовков
# [(value1, value2), ..., (..., ...)]
dataLists = [
    ('2022-06-01', 100),
    ('2022-06-02', 200),
    ('2022-06-03', 300),
    ('2022-06-04', 400),
    ('2022-06-05', 500),
]

# В данном случае необходимо самостоятельно задавать название колонок
headers = [ 'date', 'value' ]
pd.DataFrame(dataLists, columns = headers )

         date  value
0  2022-06-01    100
1  2022-06-02    200
2  2022-06-03    300
3  2022-06-04    400
4  2022-06-05    500

## Импорт данных для DataFrame из файлов

In [47]:
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html#pandas.read_csv
# Если разделитель не запятая то указываем разделитель столбцов при импорте
# заголовок у нашего файла есть, в случего если заголовкой нет, его можно задать свои названия (удобно, если изначально они на русском)
# выводим первые 10 строк

data = pd.read_csv( '../files/telecom_churn.csv', delimiter = ',')
data.head(5)

,State,Account length,Area code,International plan,Voice mail plan,Number vmail messages,Total day minutes,Total day calls,Total day charge,Total eve minutes,Total eve calls,Total eve charge,Total night minutes,Total night calls,Total night charge,Total intl minutes,Total intl calls,Total intl charge,Customer service calls,Churn
0,KS,128,415,No,Yes,25,265.1,110,45.07,197.4,99,16.78,244.7,91,11.01,10.0,3,2.70,1,False
1,OH,107,415,No,Yes,26,161.6,123,27.47,195.5,103,16.62,254.4,103,11.45,13.7,3,3.70,1,False
2,NJ,137,415,No,No,0,243.4,114,41.38,121.2,110,10.30,162.6,104,7.32,12.2,5,3.29,0,False
3,OH,84,408,Yes,No,0,299.4,71,50.90,61.9,88,5.26,196.9,89,8.86,6.6,7,1.78,2,False
4,OK,75,415,Yes,No,0,166.7,113,28.34,148.3,122,12.61,186.9,121,8.41,10.1,3,2.73,3,False

In [48]:
# Вывод последних n наблюдений
data.tail(3)

,State,Account length,Area code,International plan,Voice mail plan,Number vmail messages,Total day minutes,Total day calls,Total day charge,Total eve minutes,Total eve calls,Total eve charge,Total night minutes,Total night calls,Total night charge,Total intl minutes,Total intl calls,Total intl charge,Customer service calls,Churn
3330,RI,28,510,No,No,0,180.8,109,30.74,288.8,58,24.55,191.9,91,8.64,14.1,6,3.81,2,False
3331,CT,184,510,Yes,No,0,213.8,105,36.35,159.6,84,13.57,139.2,137,6.26,5.0,10,1.35,2,False
3332,TN,74,415,No,Yes,25,234.4,113,39.85,265.9,82,22.60,241.4,77,10.86,13.7,4,3.70,0,False

In [49]:
# основная информация о нашем DataFrame которая может показать в каких данных много пропусков и тип данных
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.info.html
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3333 entries, 0 to 3332
Data columns (total 20 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   State                   3333 non-null   object
 1   Account length          3333 non-null   int64
 2   Area code               3333 non-null   int64
 3   International plan      3333 non-null   object
 4   Voice mail plan         3333 non-null   object
 5   Number vmail messages   3333 non-null   int64
 6   Total day minutes       3333 non-null   float64
 7   Total day calls         3333 non-null   int64
 8   Total day charge        3333 non-null   float64
 9   Total eve minutes       3333 non-null   float64
 10  Total eve calls         3333 non-null   int64
 11  Total eve charge        3333 non-null   float64
 12  Total night minutes     3333 non-null   float64
 13  Total night calls       3333 non-null   int64
 14  Total night charge      3333 non-null   float64
 15  Total intl minutes      3333 non-null   float64
 16  Total intl calls        3333 non-null   int64
 17  Total intl charge       3333 non-null   float64
 18  Customer service calls  3333 non-null   int64
 19  Churn                   3333 non-null   bool
dtypes: bool(1), float64(8), int64(8), object(3)
memory usage: 498.1+ KB

In [50]:
# Базовая статистика DataFrame вывод зависит от типа данных
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.describe.html
data.describe()

,Account length,Area code,Number vmail messages,Total day minutes,Total day calls,Total day charge,Total eve minutes,Total eve calls,Total eve charge,Total night minutes,Total night calls,Total night charge,Total intl minutes,Total intl calls,Total intl charge,Customer service calls
count,3333.000000,3333.000000,3333.000000,3333.000000,3333.000000,3333.000000,3333.000000,3333.000000,3333.000000,3333.000000,3333.000000,3333.000000,3333.000000,3333.000000,3333.000000,3333.000000
mean,101.064806,437.182418,8.099010,179.775098,100.435644,30.562307,200.980348,100.114311,17.083540,200.872037,100.107711,9.039325,10.237294,4.479448,2.764581,1.562856
std,39.822106,42.371290,13.688365,54.467389,20.069084,9.259435,50.713844,19.922625,4.310668,50.573847,19.568609,2.275873,2.791840,2.461214,0.753773,1.315491
min,1.000000,408.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,23.200000,33.000000,1.040000,0.000000,0.000000,0.000000,0.000000
25%,74.000000,408.000000,0.000000,143.700000,87.000000,24.430000,166.600000,87.000000,14.160000,167.000000,87.000000,7.520000,8.500000,3.000000,2.300000,1.000000
50%,101.000000,415.000000,0.000000,179.400000,101.000000,30.500000,201.400000,100.000000,17.120000,201.200000,100.000000,9.050000,10.300000,4.000000,2.780000,1.000000
75%,127.000000,510.000000,20.000000,216.400000,114.000000,36.790000,235.300000,114.000000,20.000000,235.300000,113.000000,10.590000,12.100000,6.000000,3.270000,2.000000
max,243.000000,510.000000,51.000000,350.800000,165.000000,59.640000,363.700000,170.000000,30.910000,395.000000,175.000000,17.770000,20.000000,20.000000,5.400000,9.000000

In [51]:
# При анализе удобно применять операцию транспонирования ради того чтобы облегчить анализ признаков
data.describe().T

,count,mean,std,min,25%,50%,75%,max
Account length,3333.0,101.064806,39.822106,1.00,74.00,101.00,127.00,243.00
Area code,3333.0,437.182418,42.371290,408.00,408.00,415.00,510.00,510.00
Number vmail messages,3333.0,8.099010,13.688365,0.00,0.00,0.00,20.00,51.00
Total day minutes,3333.0,179.775098,54.467389,0.00,143.70,179.40,216.40,350.80
Total day calls,3333.0,100.435644,20.069084,0.00,87.00,101.00,114.00,165.00
Total day charge,3333.0,30.562307,9.259435,0.00,24.43,30.50,36.79,59.64
Total eve minutes,3333.0,200.980348,50.713844,0.00,166.60,201.40,235.30,363.70
Total eve calls,3333.0,100.114311,19.922625,0.00,87.00,100.00,114.00,170.00
Total eve charge,3333.0,17.083540,4.310668,0.00,14.16,17.12,20.00,30.91
Total night minutes,3333.0,200.872037,50.573847,23.20,167.00,201.20,235.30,395.00
Total night calls,3333.0,100.107711,19.568609,33.00,87.00,100.00,113.00,175.00
Total night charge,3333.0,9.039325,2.275873,1.04,7.52,9.05,10.59,17.77
Total intl minutes,3333.0,10.237294,2.791840,0.00,8.50,10.30,12.10,20.00
Total intl calls,3333.0,4.479448,2.461214,0.00,3.00,4.00,6.00,20.00
Total intl charge,3333.0,2.764581,0.753773,0.00,2.30,2.78,3.27,5.40
Customer service calls,3333.0,1.562856,1.315491,0.00,1.00,1.00,2.00,9.00

In [52]:
# Мы можем делать выборку признаков в формате
# dataset[[colname1, ..., colnameN]]
data[['Total day calls', 'Total night calls']].describe()

       Total day calls  Total night calls
count      3333.000000        3333.000000
mean        100.435644         100.107711
std          20.069084          19.568609
min           0.000000          33.000000
25%          87.000000          87.000000
50%         101.000000         100.000000
75%         114.000000         113.000000
max         165.000000         175.000000

# Форматирование столбцов

In [53]:
from pprint import pprint
# преобразование DataFrame в строку
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.to_string.html
data.head().to_string( columns = ['Area code'], header = False )

'0  415\n1  415\n2  415\n3  408\n4  415'

In [54]:
# задаем желаемый формат столбцов
formatter = {
    'Total night calls': '{:.2f}'.format,
    'Total day calls': '{:.1f}'.format,
}

In [55]:
formattedColumns = data.head().to_string( columns = ['Total night calls', 'Total day calls'], header = False, formatters = formatter )
pprint(formattedColumns)

'0  91.00 110.0\n1 103.00 123.0\n2 104.00 114.0\n3  89.00  71.0\n4 121.00 113.0'

# Поэлементные действия с DataFrame

In [56]:
# зададим два DataFrame
df1 = pd.DataFrame( [ (0, 1), (2, 3), (4, 5) ], columns = [ 'val1', 'val2' ] )
df1

   val1  val2
0     0     1
1     2     3
2     4     5

In [57]:
df2 = pd.DataFrame( [ (10, 11), (12, 13), (14, 15), (17, 18) ], columns = [ 'val1', 'val2' ] )
df2

   val1  val2
0    10    11
1    12    13
2    14    15
3    17    18

In [58]:
# функция сложения Если случилось ситуация что количество записей колоник одного датафрейма не совпадают с количество записей другого датафрейма
# или не месте записей оказались неправильные (пропущенные) значения то результатом расчета будет являться NaN
df1.add( df2 )

   val1  val2
0  10.0  12.0
1  14.0  16.0
2  18.0  20.0
3   NaN   NaN

In [59]:
# для несовпадающих строк можно воспользоваться методом fill_value и например указать 0
df1.add( df2, fill_value = 0 )

   val1  val2
0  10.0  12.0
1  14.0  16.0
2  18.0  20.0
3  17.0  18.0

### Метод combine - применение функций

In [60]:
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.combine.html
# выполнение функции func с DataFrame
df1.combine( df2, func = lambda x, y: x + y, fill_value = 0 )

   val1  val2
0  10.0  12.0
1  14.0  16.0
2  18.0  20.0
3  17.0  18.0

# mul - перемножение

In [61]:
df1.mul( df2, fill_value = 0 )

   val1  val2
0   0.0  11.0
1  24.0  39.0
2  56.0  75.0
3   0.0   0.0

# div - поэлементное деление DataFrame

In [62]:
df1.div( df2, fill_value = 17 )

       val1      val2
0  0.000000  0.090909
1  0.166667  0.230769
2  0.285714  0.333333
3  1.000000  0.944444

# Разность DataFrame

In [63]:
df1.sub( df2 )

   val1  val2
0 -10.0 -10.0
1 -10.0 -10.0
2 -10.0 -10.0
3   NaN   NaN

# Корректное копирование DataFrame

In [64]:
# зададим DataFrame
df1 = pd.DataFrame( [ (0, 1) ], columns = [ 'value1', 'value2' ] )
df1

   value1  value2
0       0       1

In [65]:
# делаем его "копию"
df2 = df1

In [66]:
# Изменяем значение ячейки в "копии"
df2['value1'][0] = 555

In [67]:
df2

   value1  value2
0     555       1

In [68]:
# Смотрим что произошло с исходным
df1

   value1  value2
0     555       1

In [69]:
# Сделаем "настоящую" копию
df1 = pd.DataFrame( [ (0, 1) ], columns = [ 'value1', 'value2' ] )
df1

   value1  value2
0       0       1

In [70]:
df2 = df1.copy()
df2['value1'][0] = 555

In [71]:
df2

   value1  value2
0     555       1

In [72]:
df1

   value1  value2
0       0       1

# Сводные таблицы

In [73]:
data = pd.read_csv( '../files/titanic_train.csv', delimiter = ',' )
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [74]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [75]:
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.pivot.html
# index - значения столбца, которые будут в строках
# columns - значения столбца, которые образуют столбцы
# values - значения в ячейках таблицы
# aggfunc - функция, которая будет применена к значениям

# среднее значение столбца 'Age' в разбивке по Sex и Embarked
pd.pivot_table( data, index = 'Sex', columns = 'Embarked', values = 'Age', aggfunc = np.mean )

Embarked          C          Q          S
Sex
female    28.344262  24.291667  27.771505
male      32.998841  30.937500  30.291440

In [76]:
# если нужно указать несколько столбцов
pd.pivot_table( data, index = ['Sex', 'Embarked'], values = 'Age', aggfunc = np.mean )

                       Age
Sex    Embarked
female C         28.344262
       Q         24.291667
       S         27.771505
male   C         32.998841
       Q         30.937500
       S         30.291440

# Apply - применить функцию к столбцу или к строке

In [77]:
data = pd.read_csv( '../files/titanic_train.csv', delimiter = ',' )
data.head(15)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S

In [78]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [79]:
def ageGroup(row):
    """
    Простая функция отнесения возраста к группе
    """
    # проверяем, что значение возраста не равно NaN
    if not pd.isnull( row['Age'] ):
        if row['Age'] <= 18:
            return 'Child'
        if row['Age'] >= 65:
            return 'Retiree'
        return 'Young'
    # если значение возраста NaN, то возвращаем Undef
    return 'Undef'

In [80]:
# применим функцию ageGroup к DataFrame и выведем результат в отдельный столбец ageGroup
data['ageGroup'] = data.apply( ageGroup, axis = 1 )
data.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ageGroup
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Young
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Young
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Young
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Young
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Young
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,Undef
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,Young
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S,Child
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S,Young
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C,Child

In [81]:
# например, устанавливаем формат отображения
df = pd.DataFrame( np.random.randn(10, 3), columns = ['first', 'second', 'third'] )
df

      first    second     third
0 -0.233502  1.451584 -0.388473
1  0.665392 -0.242813 -0.650971
2 -1.346969 -0.485599 -0.321549
3 -0.058582  1.689262  0.382510
4 -1.814367  0.533569  0.841732
5  0.260352 -1.404108 -0.068219
6 -0.665328  1.590949  0.714811
7 -0.087933  1.230618 -0.656570
8 -0.187547 -0.583266 -0.597481
9 -0.177721 -0.508935  0.169048

In [82]:
df.apply(lambda x: x**2 )

      first    second     third
0  0.054523  2.107095  0.150911
1  0.442747  0.058958  0.423763
2  1.814326  0.235807  0.103394
3  0.003432  2.853605  0.146314
4  3.291929  0.284696  0.708512
5  0.067783  1.971521  0.004654
6  0.442661  2.531118  0.510954
7  0.007732  1.514422  0.431084
8  0.035174  0.340199  0.356983
9  0.031585  0.259014  0.028577

# Сохранение DataFrame

In [ ]:
data.head()

In [84]:
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.to_csv.html


# разделитель sep по умолчанию запятая
# na_rep - что ставим на место пустых ячеек
# columns - какие столбцы хотим записать
# index - включать ли номер строки

data.to_csv( '../files/train_modified.csv', sep = ',', columns = ['Survived', 'ageGroup'], index = False )

In [85]:
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.to_json.html
# при сохранении в JSON может быть несколько вариантов группировки данных

# orient = index - строки имеют вид
# {"0":{"PassengerId":1,"Survived":0,"Pclass":3,"Name":"Braund, Mr. Owen Harris","Sex":"male","Age":22.0,"SibSp":1,"Parch":0,"Ticket":"A\/5 21171","Fare":7.25,"Cabin":null,"Embarked":"S","ageGroup":"Young"}

data.to_json( '../output/train_json_index.json', orient = 'index')

In [ ]:
# другие варианты
data.to_json( './output/train_json_columns.json', orient = 'columns' )
data.to_json( './output/train_json_records.json', orient = 'records' )

In [ ]:
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.to_excel.html
# сохранение в Excel
data.to_excel( './output/train_modified.xlsx', sheet_name = 'data' )

# Прочие действия с DataFrame

In [86]:
data = pd.read_csv( '../files/titanic_train.csv', delimiter = ',' )
data.head(15)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S

In [87]:
# выбрать все строки и подмножество столбцов
dataSelected = data.loc[:3, ['Name', 'Age', 'Cabin']]
dataSelected.head()

                                                Name   Age Cabin
0                            Braund, Mr. Owen Harris  22.0   NaN
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0   C85
2                             Heikkinen, Miss. Laina  26.0   NaN
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  C123

In [89]:
# добавляем к фильтру строки
# например, с третьей до последней

dataSelected = data.loc[2:15, ['Name', 'Age', 'Cabin']]
dataSelected.head(15)

                                                 Name   Age Cabin
2                              Heikkinen, Miss. Laina  26.0   NaN
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  C123
4                            Allen, Mr. William Henry  35.0   NaN
5                                    Moran, Mr. James   NaN   NaN
6                             McCarthy, Mr. Timothy J  54.0   E46
7                      Palsson, Master. Gosta Leonard   2.0   NaN
8   Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0   NaN
9                 Nasser, Mrs. Nicholas (Adele Achem)  14.0   NaN
10                    Sandstrom, Miss. Marguerite Rut   4.0    G6
11                           Bonnell, Miss. Elizabeth  58.0  C103
12                     Saundercock, Mr. William Henry  20.0   NaN
13                        Andersson, Mr. Anders Johan  39.0   NaN
14               Vestrom, Miss. Hulda Amanda Adolfina  14.0   NaN
15                   Hewlett, Mrs. (Mary D Kingcome)   55.0   NaN

# Добавление столбцов

In [94]:
data['ageSquared'] = data['Age']**2
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ageSquared
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,484.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1444.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,676.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1225.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1225.0

In [95]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'ageSquared'],
      dtype='object')

In [96]:
# удаляем наши вычисления
del data['ageSquared']
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [97]:
df.drop(data['SibSp'], inplace=True)

In [98]:
# переименование столбца
# параметр inplace указывает, что надо подставить новое значение в самом DataFrame data
data.rename( columns = { 'Name': 'f_name' }, inplace = True )
data.head()

,PassengerId,Survived,Pclass,f_name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [99]:
# можно заменить названия столбцов
# например, иногда русские названия в исходных данных доставляют трудности
data.columns = [ 'ID', 'Survived', 'Class', 'f_name', 'Gender', 'Age', 'SibSp', 'Parch', 'Ticker number', 'Fare', 'Cabin', 'Embarked' ]
data.head()

,ID,Survived,Class,f_name,Gender,Age,SibSp,Parch,Ticker number,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Действия со строками

In [100]:
data = pd.read_csv( '../files/titanic_train.csv', delimiter = ',' )
data.head(15)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S

In [102]:
# выбрать нужные строки
# например, со второй по пятую
print(data.loc[ 1:5 ].values)

[[2 1 1 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)' 'female'
  38.0 1 0 'PC 17599' 71.2833 'C85' 'C']
 [3 1 3 'Heikkinen, Miss. Laina' 'female' 26.0 0 0 'STON/O2. 3101282'
  7.925 nan 'S']
 [4 1 1 'Futrelle, Mrs. Jacques Heath (Lily May Peel)' 'female' 35.0 1 0
  '113803' 53.1 'C123' 'S']
 [5 0 3 'Allen, Mr. William Henry' 'male' 35.0 0 0 '373450' 8.05 nan 'S']
 [6 0 3 'Moran, Mr. James' 'male' nan 0 0 '330877' 8.4583 nan 'Q']]

In [105]:
# выбор с набором значений
# строки с номерами 1, 2, 3 и 44
dataNew = data.iloc[ [1, 2, 5] ]

In [106]:
dataNew

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [107]:
dataNew.reset_index(inplace=True)

In [108]:
dataNew

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
1,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
2,5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [109]:
# можно задать маску, по которой будут фильтроваться строки
# например, ID пассажира делится на 2
mask = ( data.PassengerId % 2 == 0)

In [110]:
mask[:5]

0    False
1     True
2    False
3     True
4    False
Name: PassengerId, dtype: bool

In [111]:
data.loc[ mask ].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

# Работа с пустыми значениями

In [ ]:
data = pd.read_csv( './files/titanic_train.csv', delimiter = ',' )
data.head(15)

In [ ]:
# В столбце Age довольно много пустых значений
data.info()

In [ ]:
# посмотрим что это за строки
data.loc[pd.isnull( data['Age'])].head()

In [ ]:
# заменим пустые значения столбца Age на медиану
medianAge = data['Age'].median()
medianAge

In [ ]:
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.fillna.html
data['Age'].fillna( medianAge, inplace = True )

In [ ]:
# итак, значение для строки с индексом 5 (было NaN) заменено на среднее
data.head(10)

# Сортировка DataFrame

In [ ]:
# сортировка по индексу
data.sort_index( ascending = False ).head()

In [ ]:
# сортировка по значениям
data.sort_values( by = 'Age', ascending = False ).head()

In [ ]:
# сортировка по значениям нескольких столбцов
data.sort_values( by = ['Sex', 'Age'], ascending = [True, False] ).head()

# Аггрегация и группировка

In [ ]:
data = pd.read_csv( './files/titanic_train.csv', delimiter = ',' )
data.head(15)

In [ ]:
# число непустых строк в DataFrame
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.count.html
data.count()

In [ ]:
# для отдельного столбца
data['Age'].count()

In [ ]:
# сумма
data.sum()

In [ ]:
# комбинация функций
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.aggregate.html
data.aggregate( ['sum', 'mean'] )

In [ ]:
# агрегация по столбцам (agg - синоним aggregate)
data.agg( { 'Age': ['mean'], 'Survived': ['mean', 'sum'] } )

In [ ]:
# группировка по столбцу с вычислением среднего
data.groupby( 'Sex' ).mean()

In [ ]:
# группировка по нескольким столбцам одновременно
data.groupby( ['Sex', 'Age'] ).mean()

# Объединение DataFrame

In [ ]:
# Merge - аналог JOIN в SQL
# заведем два DataFrame
df1 = pd.DataFrame( {
    'key1': ['one', 'two', 'three', 'only1'],
    'value': [1, 2, 3, 4]
} )

In [ ]:
df1

In [ ]:
df2 = pd.DataFrame( {
    'key2': ['one', 'two', 'three', 'only2'],
    'value': [11, 12, 13, 14]
} )

In [ ]:
df2

In [ ]:
# сохраняем все значения ключей, которые есть в df1
# если нужно несколько столбцов, то пишем left_on = ['key1', ...] и right_on = ['key2', ...]
df1.merge( df2, how = 'left', left_on = 'key1', right_on = 'key2' )

In [ ]:
# сохраняем все значения ключей, которые есть в df2
df1.merge( df2, how = 'right', left_on = 'key1', right_on = 'key2' )

In [ ]:
# сохраняем все значения ключей (объединение)
df1.merge( df2, how = 'outer', left_on = 'key1', right_on = 'key2' )

In [ ]:
# сохраняем только общие значения ключей
df1.merge( df2, how = 'inner', left_on = 'key1', right_on = 'key2' )

# Concat - совмещение DataFrame

In [ ]:
# объединение DataFrame путем обычного "склеивания"
pd.concat( [df1, df2] )

In [ ]:
# горизонтальное объединение
pd.concat( [df1, df2], axis = 1 )

In [ ]:
# Join - объединение по индексу
df1 = pd.DataFrame( {
    'key1': ['one', 'two', 'three', 'only1'],
    'value': [1, 2, 3, 4]
    },
    index = ['0', '1', '2', '3'])

In [ ]:
df1

In [ ]:
df2 = pd.DataFrame( {
    'key2': ['one', 'two', 'three', 'only2'],
    'value': [11, 12, 13, 14]
    },
    index = ['2', '3', '4', '5'])

In [ ]:
df2

In [ ]:
# для join надо указать lsuffix и rsuffix

df1.join( df2, how = 'left', lsuffix = '_df1', rsuffix = '_df2' )